Write a Pandas program to add, subtract, multiple and divide two Pandas Series.

Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [1]:
import numpy as np
import pandas as pd

In [2]:
d1 = pd.Series([2,4,6,8])
d2 = pd.Series([1,3,5,7])

ds = d1+d2

ds = d1*d2

ds = d1-d2

ds = d1/d2
ds

0    2.000000
1    1.333333
2    1.200000
3    1.142857
dtype: float64

Write a Pandas program to convert a NumPy array to a Pandas series.


Sample NumPy array: d1 = [10, 20, 30, 40, 50]

In [3]:
d1 = [10, 20, 30, 40, 50]
df = pd.DataFrame(d1)
df

    0
0  10
1  20
2  30
3  40
4  50

Write a Pandas program to create the mean and standard deviation of the data of a given Series.

In [11]:
print('Mean is: ', df.mean())
print('Standard Deviation is: ', df.std())

Mean is:  0    30.0
dtype: float64
Standard Deviation is:  0    15.811388
dtype: float64

Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
<br>
Sample DataFrame:<br>
exam_data = {'name': ['Anastasia', 'Dima', , 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],<br>
'score': [12.5, 9, 16.5, 9, 20, 14.5,8, 19],<br>
'attempts': [1, 3, 2, 3, 2, 1, 2, 1],<br>
'qualify': ['yes', 'no', 'yes', 'yes', 'yes', 'no', 'no', 'yes']}<br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

In [13]:
exam_data = {'name': ['Anastasia', 'Dima', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],       
'score': [12.5, 9, 16.5, 9, 20, 14.5,8, 19],
'attempts': [1, 3, 2, 3, 2, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'yes', 'yes', 'no', 'no', 'yes'] }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

examDetails = pd.DataFrame(exam_data,index=labels)
examDetails

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c      Emily   16.5         2     yes
d    Michael    9.0         3     yes
e    Matthew   20.0         2     yes
f      Laura   14.5         1      no
g      Kevin    8.0         2      no
h      Jonas   19.0         1     yes

Write a Pandas program to get the first 3 rows of a given DataFrame.
<br>
Sample DataFrame:<br>
exam_data = {'name': ['Anastasia', 'Dima', , 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],<br>
'score': [12.5, 9, 16.5, 9, 20, 14.5,8, 19],<br>
'attempts': [1, 3, 2, 3, 2, 1, 2, 1],<br>
'qualify': ['yes', 'no', 'yes', 'yes', 'yes', 'no', 'no', 'yes']}<br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

In [14]:
examDetails.loc[:'c']

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c      Emily   16.5         2     yes

Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.
<br>
Sample DataFrame:<br>
exam_data = {'name': ['Anastasia', 'Dima', , 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],<br>
'score': [12.5, 9, 16.5, 9, 20, 14.5,8, 19],<br>
'attempts': [1, 3, 2, 3, 2, 1, 2, 1],<br>
'qualify': ['yes', 'no', 'yes', 'yes', 'yes', 'no', 'no', 'yes']}<br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

In [15]:
update = pd.DataFrame(exam_data,index=labels)
update[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c      Emily   16.5
d    Michael    9.0
e    Matthew   20.0
f      Laura   14.5
g      Kevin    8.0
h      Jonas   19.0

Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.
Sample DataFrame:<br>
exam_data = {'name': ['Anastasia', 'Dima', , 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],<br>
'score': [12.5, 9, 16.5, 9, 20, 14.5,8, 19],<br>
'attempts': [1, 3, 2, 3, 2, 1, 2, 1],<br>
'qualify': ['yes', 'no', 'yes', 'yes', 'yes', 'no', 'no', 'yes']}<br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

In [26]:
f_attempt = examDetails.attempts > 2
examDetails.loc[f_attempt,]

      name  score  attempts qualify
b     Dima    9.0         3      no
d  Michael    9.0         3     yes

Write a Pandas program to join the two given dataframes along rows and assign all data.

[10, 20, 30, 40, 50]

Write a Pandas program to join the two dataframes using the common column of both dataframes.

Write a Pandas program to sort the data frame first by 'name' in descending order, then by 'score' in ascending order.

Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.

Write a Pandas program to split the following given dataframe into groups based on single column and multiple columns. Find the size of the grouped data.